export const chatInfo = {
    errorEmoticonList : [
        `🥲`,`🥸`,`🪨`,`🪵`,`🛖`,
        `♨️`,`🛻`,`🛼`,`🦬`,`🦣`,
        `🦫`,`🪶`,`🦤`,`🦭`,`🪲`,
        `🪳`,`🪳`,`🪱`,`🪰`,`🪴`],

    emoticonListSmileys : [
        "😀","😃","😄","😁","😆","😅","🤣","😂","🙂","🙃",
        "😉","😊","😇","🥰","😍","🤩","😘","😗","☺️","😚",
        "😙","😋","😛","😜","🤪","😝","🤑","🤗","🤭","🤫",
        "🤔","🤐","🤨","😐","😑","😶","😏","😒","🙄","😬",
        "🤥","😌","😔","😪","🤤","😴","😷","🤒","🤕","🤢",
        "🤮","🤧","🥵","🥶","🥴","😵","🤯","🤠","🥳",
        "😎","🤓","🧐","😕","😟","🙁","☹️","😮","😯","😲",
        "😳","🥺","😦","😧","😨","😰","😥","😢","😭","😱",
        "😖","😣","😞","😓","😩","😫","🥱","😤","😡","😠",
        "🤬","😈","👿","💀","☠️","💩","🤡","👹","👺","👻",
        "👽","👾","🤖","😺","😸","😹","😻","😼","😽","🙀",
        "😿","😾","🙈","🙉","🙊","💋","💌","💘","💝","💖",
        "💗","💓","💞","💕","💟","❣️","💔","❤️","🧡","💛",
        "💚","💙","💜","🤎","🖤","🤍","💯","💢","💥","💫",
        "💦","💨","🕳️","💣","💬","👁️‍🗨️","🗨️","🗯️","💭","💤",
    ],

    emoticonListTravel : [
        "🌍","🌎","🌏","🌐","🗺️","🗾","🧭","🏔️","⛰️","🌋",
        "🗻","🏕️","🏖️","🏜️","🏝️","🏞️","🏟️","🏛️","🏗️","🧱",
        "🏘️","🏚️","🏠","🏡","🏢","🏣","🏤","🏥","🏦","🏨",
        "🏩","🏪","🏫","🏬","🏭","🏯","🏰","💒","🗼","🗽",
        "⛪","🕌","🛕","🕍","⛩️","🕋","⛲","⛺","🌁","🌃",
        "🏙️","🌄","🌅","🌆","🌇","🌉","🎠","🎡","🎢","💈",
        "🎪","🚂","🚃","🚄","🚅","🚆","🚇","🚈","🚉","🚊",
        "🚝","🚞","🚋","🚌","🚍","🚎","🚐","🚑","🚒","🚓",
        "🚔","🚕","🚖","🚗","🚘","🚙","🚚","🚛","🚜","🏎️",
        "🏍️","🛵","🦽","🦼","🛺","🚲","🛴","🛹","🚏","🛣️",
        "🛤️","🛢️","⛽","🚨","🚥","🚦","🛑","🚧","⚓","⛵",
        "🛶","🚤","🛳️","⛴️","🛥️","🚢","✈️","🛩️","🛫","🛬",
        "🪂","💺","🚁","🚟","🚠","🚡","🛰️","🚀","🛸","🛎️",
        "🧳","⌛","⏳","⌚","⏰","⏱️","⏲️","🕰️","🕛","🕧",
        "🕐","🕜","🕑","🕝","🕒","🕞","🕓","🕟","🕔","🕠",
        "🕕","🕡","🕖","🕢","🕗","🕣","🕘","🕤","🕙","🕥",
        "🕚","🕦","🌑","🌒","🌓","🌔","🌕","🌖","🌗","🌘",
        "🌙","🌚","🌛","🌜","🌡️","☀️","🌝","🌞","🪐","⭐",
        "🌟","🌠","🌌","☁️","⛅","⛈️","🌤️","🌥️","🌦️","🌧️",
        "🌨️","🌩️","🌪️","🌫️","🌬️","🌀","🌈","🌂","☂️","☔",
        "⛱️","⚡","❄️","☃️","⛄","☄️","🔥","💧","🌊",    
    ],

    emoticonListAnimals : [
        "🐵","🐒","🦍","🦧","🐶","🐕","🦮","🐕‍🦺","🐩","🐺",
        "🦊","🦝","🐱","🐈","🐈‍⬛","🦁","🐯","🐅","🐆",
        "🐴","🐎","🦄","🦓","🦌","🐮","🐂","🐃","🐄","🐷",
        "🐖","🐗","🐽","🐏","🐑","🐐","🐪","🐫","🦙","🦒",
        "🐘","🦏","🦛","🐭","🐁","🐀","🐹","🐰","🐇","🐿️",
        "🦔","🦇","🐻","🐻‍❄️","🐨","🐼","🦥","🦦","🦨",
        "🦘","🦡","🐾","🦃","🐔","🐓","🐣","🐤","🐥","🐦",
        "🐧","🕊️","🦅","🦆","🦢","🦉","🦩","🦚","🦜","🐸",
        "🐊","🐢","🦎","🐍","🐲","🐉","🦕","🦖","🐳","🐋",
        "🐬","🐟","🐠","🐡","🦈","🐙","🐚","🐌","🦋","🐛",
        "🐜","🐝","🐞","🦗","🕷️","🕸️","🦂","🦟","🦠","💐",
        "🌸","💮","🏵️","🌹","🥀","🌺","🌻","🌼","🌷","🌱",
        "🌲","🌳","🌴","🌵","🌾","🌿","☘️","🍀","🍁","🍂",
        "🍃"
    ],

    emoticonList(){
        return [ ...this.emoticonListSmileys, ...this.emoticonListTravel, ...this.emoticonListAnimals ]
    },
    /**
     *  최근사용 이모티콘 
     * @example ["😦","😪","🤤","😴","😃","😄","🐒","🐵"]
    */
    recentEmotcions : [],

    /**
     * 로컬에 저장된 최근사용 이모티콘 데이터 가져오기 
     * @return { Array } 
    */
    getRecentEmoticon(){
        try {
            this.recentEmotcions = JSON.parse( localStorage.getItem("recentEmoticon"));
            if( !Array.isArray(this.recentEmotcions) )
                throw Error()
        } catch (error) {
            console.log("parseError", error);
            this.recentEmotcions = [];
            localStorage.setItem("recentEmoticon", JSON.stringify(this.recentEmotcions) )
        }
        return this.recentEmotcions = [ ...new Set( this.recentEmotcions)];
    },

    /**
     * 최근 사용 이모티콘 데이터 저장 
     * 채팅 입력시 실행 
    */
    setRecentEmoticon(emoticons){
        if( !Array.isArray(emoticons)  )
            return;
        emoticons.forEach(emoticon => {
            // 이모티콘 중복 제거 
            if( this.recentEmotcions.includes(emoticon)){
                const index = this.recentEmotcions.indexOf(emoticon);
                this.recentEmotcions = [ ...this.recentEmotcions.slice(0, index), ...this.recentEmotcions.slice(index + 1)]
            }
            // 이모티콘 추가 
            this.recentEmotcions = [...this.recentEmotcions, emoticon];
        });

        localStorage.setItem("recentEmoticon", JSON.stringify( this.recentEmotcions) );
    }
}